# Exercise 26 - Celebrity Deaths

## Sidebar: Combining and Splitting Columns

Remember that Python slices are always of the form [start:end+1]. So if we want the characters at index 3 and index 4, we ask for 3:5, which means “starting at 3, up to and not including 5.”

In [34]:
s = '00:11:22'
print(s[3:5]) # prints '11'

11

### find the average age of celebrities who died February–July 2016. (page 144)

In [35]:
!head ../data/celebrity_deaths_2016.csv

2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,,,unced on this date),euthanized,,20052010).",,,).",,,,stcards from the Edge) and mental health advocate.",complications from a heart attack,,,,,of Appeals for the D.C. Circuit (19791994).",complications from bladder cancer,,

In [36]:
!wc ../data/celebrity_deaths_2016.csv

       0   48468  537921 ../data/celebrity_deaths_2016.csv

In [101]:
import pandas as pd
import numpy as np

In [38]:
df = pd.read_csv('../data/celebrity_deaths_2016.csv', header=0, usecols=['dateofdeath', 'age'])

In [39]:
df['month'] = df['dateofdeath'].str.slice(5,7)

In [40]:
df.head()

  dateofdeath age month
0  2016-01-01  71    01
1  2016-01-01  74    01
2  2016-01-01  79    01
3  2016-01-01  45    01
4  2016-01-01  83    01

In [41]:
df.isnull().sum()

dateofdeath     0
age            27
month           0
dtype: int64

In [42]:
df = df.set_index('month')

In [43]:
df = df.sort_index()

In [45]:
df.head()

      dateofdeath age
month
01     2016-01-01  71
01     2016-01-21  47
01     2016-01-21  87
01     2016-01-21  90
01     2016-01-21  73

In [46]:
df = df.dropna(subset='age')

In [47]:
df['age'].count() - df['age'].str.isdigit().sum()

35

In [49]:
df.loc[df['age'].str.isdigit() == False].head()

      dateofdeath    age
month
01     2016-01-07   8889
02     2016-02-20   6869
02     2016-02-29   3031
02     2016-02-15   5253
02     2016-02-08   4445

In [50]:
s = pd.to_numeric(df['age'], errors='coerce')

In [51]:
df['age'] = s

/var/folders/mm/h2z28vhs6cdbnsksl2fzl19w0000gn/T/ipykernel_25050/1702247557.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['age'] = s

In [52]:
df['age'].describe()

count    6505.000000
mean      100.960338
std       413.994127
min         7.000000
25%        69.000000
50%        81.000000
75%        89.000000
max      9394.000000
Name: age, dtype: float64

In [53]:
df = df.loc[df['age'] < 120]

In [54]:
df['age'].describe()

count    6481.000000
mean       77.019287
std        16.428815
min         7.000000
25%        69.000000
50%        81.000000
75%        89.000000
max       116.000000
Name: age, dtype: float64

In [55]:
df.loc['02':'07', 'age'].mean()

77.17887409200968

### Add a new column, day, from the day of the month in which the celebrity died.  Then create a multi-index (from month and day). What was the average age of death from Feb. 15 through July 15?

In [119]:
df = pd.read_csv('../data/celebrity_deaths_2016.csv', header=0, usecols=['dateofdeath', 'age'])
df['month'] = df['dateofdeath'].str.slice(5,7)
df['day'] = df['dateofdeath'].str.slice(8,None)

In [120]:
df.head()

  dateofdeath age month day
0  2016-01-01  71    01  01
1  2016-01-01  74    01  01
2  2016-01-01  79    01  01
3  2016-01-01  45    01  01
4  2016-01-01  83    01  01

In [121]:
df = df.dropna(subset='age')

In [122]:
df = df.loc[df['age'].str.isdigit()]

In [123]:
# (2) Remove all non-digits
# df = df[df['age'].str.isdigit()]
df['age'] = df['age'].astype(np.int64)

In [124]:
df.head()

  dateofdeath  age month day
0  2016-01-01   71    01  01
1  2016-01-01   74    01  01
2  2016-01-01   79    01  01
3  2016-01-01   45    01  01
4  2016-01-01   83    01  01

In [142]:
# df['month'].value_counts()

In [143]:
# df['day'].value_counts()

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6481 entries, 0 to 6542
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dateofdeath  6481 non-null   object
 1   age          6481 non-null   int64
 2   month        6481 non-null   object
 3   day          6481 non-null   object
dtypes: int64(1), object(3)
memory usage: 253.2+ KB

In [129]:
df.describe()

               age
count  6481.000000
mean     77.019287
std      16.428815
min       7.000000
25%      69.000000
50%      81.000000
75%      89.000000
max     116.000000

In [130]:
df = df.set_index(['month','day'])

In [131]:
df = df.sort_index()

In [132]:
df.head()

          dateofdeath  age
month day
01    01   2016-01-01   71
      01   2016-01-01   74
      01   2016-01-01   79
      01   2016-01-01   45
      01   2016-01-01   83

In [133]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 6481 entries, ('01', '01') to ('12', '29')
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dateofdeath  6481 non-null   object
 1   age          6481 non-null   int64
dtypes: int64(1), object(1)
memory usage: 115.7+ KB

### Note leading '0's required in indexes

In [135]:
df.loc[('02','15'):('07','15'), 'age'].mean()

77.05183037332367

### The CSV file contains another column, causeofdeath. Load it into a data frame, and find the five most common causes of death. Now replace any NaN values in that column with the string 'unknown', and again find the five most common causes of death.

In [148]:
df = pd.read_csv('../data/celebrity_deaths_2016.csv', header=0, usecols=['causeofdeath'])

In [149]:
df.value_counts()[:5]

causeofdeath
cancer               248
heart attack         125
traffic collision     56
lung cancer           51
pneumonia             50
Name: count, dtype: int64

In [150]:
df['causeofdeath'] = df['causeofdeath'].replace(np.nan, 'unknown')

In [151]:
df.value_counts()[:5]

causeofdeath
unknown               5008
 cancer                248
 heart attack          125
 traffic collision      56
 lung cancer            51
Name: count, dtype: int64

### If someone asked whether cancer is in the top 10 causes, what would you say?  Can you be more specific than that?